{
    "metric": "Ship rooms",
    "filterBelow": 5.0,
    "results": [
        {
            "ship": "EXPLORER",
            "sailingNumber": "1",
            "averageRating": 6.88,
            "ratingCount": 57,
            "filteredReviews": [
                "Based on the guest review, I would rate the following attributes:\n\n1. Ship Overall: 4/10\nThe guest mentions that the cruise didn't live up to their expectations, which suggests a negative overall experience.\n\n2. Ship Rooms: 3/10\nThe guest specifically mentions an issue with the air con in their cabin being noisy and interrupting their sleep.\n\n3. F&B Quality Overall: N/A (no mention of food quality)\n4. F&B Service Overall: N/A (no mention of service quality)\n5. F&B Quality Main Dining: N/A (no mention of main dining room quality)\n6. Entertainment: N/A (no mention of entertainment options or quality)\n7. Excursions: N/A (no mention of excursion experiences or quality)\n\n8. Primary Issues Mentioned: 9/10\nThe guest mentions two primary issues: the noisy air con in their cabin and being ill with Norovirus.\n\n9. Sentiment Analysis:\nThe sentiment of the review is overwhelmingly negative, with a score of -5/10 (on a scale where 0 is neutral and 10 is extremely positive). The guest's use of words like \"disappointing\" and their explicit mention of health issues suggest a strong negative emotional tone.\n\nNote: Since some attributes were not mentioned in the review, I rated them as 'N/A'.",
                "Based on the guest review, I would score it as follows:\n\n1. Ship Overall: 6/10\nThe guest mentions some negative aspects of their experience, such as the strong cocktails and lack of fridges in rooms, but also praises the staff, which suggests that there are positive aspects to the ship.\n\n2. Ship Rooms: 4/10\nThe guest expresses disappointment with the lack of fridges in rooms, which is a significant issue for them. They do not mention any positive aspects of their room experience.\n\n3. F&B Quality Overall: 5/10\nThe guest mentions that the food could have been better and that the beer on tap was limited and not great. However, they also praise the staff, which suggests that the overall quality of the food and beverage is not a major issue for them.\n\n4. F&B Service Overall: 9/10\nThe guest explicitly states that they \"cannot fault the staff\" on the ship, which suggests that the service was excellent.\n\n5. F&B Quality Main Dining: N/A\nThe guest does not mention anything specific about the quality of main dining, so I would rate this as 'n/a'.\n\n6. Entertainment: N/A\nThe guest does not mention anything about the entertainment options on board, so I would rate this as 'n/a'.\n\n7. Excursions: N/A\nThe guest does not mention anything about excursions, so I would rate this as 'n/a'.\n\n8. Primary Issues Mentioned: 2/10 (strong cocktails and lack of fridges in rooms)\nThese are the two main issues mentioned by the guest.\n\n9. Sentiment Analysis: 7/10\nThe guest's tone is generally positive, with a few negative comments about specific aspects of their experience. However, they also express disappointment and frustration, which brings down the overall sentiment score.",
                "Based on the guest review, I would score it as follows:\n\n1. Ship Overall: 6/10\nThe guest mentions some negative experiences, such as the bad smell outside their cabin and difficulty getting a sun lounger, but also mentions that they enjoyed the all-inclusive aspect of the cruise.\n\n2. Ship Rooms: 4/10\nThe guest had issues with the smell in their cabin (4012) and experienced sickness, which suggests that the room was not to their standards.\n\n3. F&B Quality Overall: N/A\nThere is no mention of food quality in the review.\n\n4. F&B Service Overall: N/A\nThere is no mention of food service in the review.\n\n5. F&B Quality Main Dining: N/A\nThere is no mention of main dining quality in the review.\n\n6. Entertainment: N/A\nThere is no mention of entertainment in the review.\n\n7. Excursions: N/A\nThere is no mention of excursions in the review.\n\n8. Primary Issues Mentioned:\n- Bad smell outside cabin\n- Sickness experienced during the cruise\n- Difficulty getting a sun lounger due to belongings being left on them\n\n9. Sentiment Analysis: 4/10\nThe guest's tone is neutral, but slightly negative due to the issues they experienced. They mention that it was their first Marella cruise and that they enjoyed the all-inclusive aspect, which suggests that they were somewhat satisfied with their experience overall.\n\nNote: The scores are subjective and based on my interpretation of the review.",
                "Based on the guest review, here are my scores:\n\n1. Ship Overall: 8/10\nThe guest mentions that the staff is \"fantastic\" and the food and entertainment are good, which suggests a positive overall experience. However, they also mention some significant issues with their cabin location, which brings down the score.\n\n2. Ship Rooms: 4/10\nThe guest's cabin was described as \"adequate\", but this is a very low rating due to the noise and vibration issues mentioned. They specifically state that cabins on deck 4 at the rear of the ship are not worth the money due to the noise.\n\n3. F&B Quality Overall: 9/10\nThe guest mentions that the food is \"great\" and the entertainment is good, which suggests a high rating for the food and beverage quality overall.\n\n4. F&B Service Overall: 9/10\nSimilar to the previous point, the guest praises the staff as \"fantastic\", which suggests a high rating for the service overall.\n\n5. F&B Quality Main Dining: N/A\nThe review does not specifically mention the main dining experience, so I have rated it as 'n/a'.\n\n6. Entertainment: 8/10\nThe guest mentions that the entertainment is good, but this score is based on limited information and could be higher if they had more to say about their experiences.\n\n7. Excursions: N/A\nThere is no mention of excursions in the review, so I have rated it as 'n/a'.\n\n8. Primary Issues Mentioned: 6/10\nThe guest mentions two primary issues: the noise and vibration in their cabin location, which made it impossible to sleep, and the fact that cabins on deck 4 at the rear of the ship are not worth the money due to the noise.\n\n9. Sentiment Analysis:\nThe sentiment analysis suggests that the guest is generally very positive about their experience (80% positive language), but they also express frustration and disappointment with the cabin location issues (20% negative language). Overall, the sentiment is mixed, but leaning towards being more positive than negative.",
                "Based on the provided guest review, I would rate the scores as follows:\n\n1. Ship Overall: 4/10\nThe guest mentions that their experience was \"ok\", which suggests a neutral or mediocre rating. However, the negative comments about the mattresses and sickness suggest that there were some significant issues with the ship.\n\n2. Ship Rooms: 3/10\nThe guest specifically mentions that the mattresses were terrible, which is a major issue with the rooms. This score reflects the negative experience in this area.\n\n3. F&B Quality Overall: N/A\nThere is no mention of food quality in the review, so I would rate this as \"n/a\".\n\n4. F&B Service Overall: N/A\nSimilarly, there is no mention of service quality in the review, so I would also rate this as \"n/a\".\n\n5. F&B Quality Main Dining: N/A\nAs mentioned earlier, food quality is not mentioned in the review.\n\n6. Entertainment: N/A\nThere is no mention of entertainment in the review, so I would rate this as \"n/a\".\n\n7. Excursions: N/A\nExcursions are also not mentioned in the review, so I would rate this as \"n/a\".\n\n8. Primary Issues Mentioned: 2/10 (Sickness and mattresses)\nThe guest mentions two specific issues that they experienced during their stay on the ship.\n\n9. Sentiment Analysis: 2/10 (Neutral/Mixed)\nThe guest's tone is neutral, but with a hint of frustration and disappointment. The use of phrases like \"it was ok\" and \"they were terrible\" suggests a mixed sentiment.",
                "Based on the provided guest review, I would rate the attributes as follows:\n\n1. Ship Overall: 6/10\nThe reviewer mentions that the ship offers \"great value for the price\" and has \"overall service\", indicating a positive experience. However, they also mention a significant drawback (the removal of fridges from cabins), which brings down their overall rating.\n\n2. Ship Rooms: 4/10\nThe reviewer criticizes the lack of fridges in cabins, suggesting that this is a major issue with the ship's accommodations. They also mention that the space could have been finished off to make it more usable, implying that the rooms are not well-designed or functional.\n\n3. F&B Quality Overall: 8/10\nThe reviewer does not provide specific feedback on food quality, but their overall tone suggests that they were satisfied with the dining experience. They do mention \"great value for the price\", which implies that the food is reasonably priced and of good quality.\n\n4. F&B Service Overall: 9/10\nSimilar to the previous point, the reviewer does not provide specific feedback on service quality, but their overall tone suggests that they were satisfied with the service. They do mention \"overall service\" as a positive aspect, which implies that the staff was friendly and attentive.\n\n5. F&B Quality Main Dining: N/A\nThe reviewer does not provide any feedback on the main dining experience, so I would rate this attribute as 'n/a'.\n\n6. Entertainment: N/A\nThere is no mention of entertainment in the review, so I would also rate this attribute as 'n/a'.\n\n7. Excursions: N/A\nExcursions are not mentioned at all in the review, so I would rate this attribute as 'n/a'.\n\n8. Primary Issues Mentioned: 2/10 (removal of fridges from cabins)\nThe reviewer specifically mentions one major issue with the ship's accommodations (the removal of fridges) and a minor design flaw (the space not being finished off to make it more usable).\n\n9. Sentiment Analysis:\nThe overall sentiment of the review is negative, as the reviewer expresses disappointment and frustration with the removal of fridges from cabins. However, they also mention some positive aspects (great value for the price, overall service), which suggests that their experience was not entirely negative. I would rate the sentiment analysis as 5/10, indicating a mixed but generally negative tone.",
                "Based on the guest review, I would score it as follows:\n\n1. Ship Overall: 4/10\nThe guest mentions several negative aspects of their experience, including unavailability of staff, overpricing, small cabin size, uncomfortable bed, and poor food quality.\n\n2. Ship Rooms: 3/10\nThe guest specifically mentions that the balcony cabin was \"small for 3 people\" and that the bed was \"very uncomfortable\", indicating a subpar room experience.\n\n3. F&B Quality Overall: 5/10\nThe guest describes the food as \"average\" and \"repetitive\", suggesting that the quality of the food was not exceptional.\n\n4. F&B Service Overall: N/A (not mentioned)\nThere is no mention of the service in the review, so I would rate it as 'n/a'.\n\n5. F&B Quality Main Dining: 5/10\nSimilar to the overall F&B quality score, the guest describes the main dining experience as \"average\" and \"repetitive\".\n\n6. Entertainment: N/A (not mentioned)\nThere is no mention of the entertainment in the review, so I would rate it as 'n/a'.\n\n7. Excursions: N/A (not mentioned)\nThere is no mention of excursions in the review, so I would rate it as 'n/a'.\n\n8. Primary Issues Mentioned: 6/10\nThe guest mentions several primary issues, including unavailability of staff, overpricing, small cabin size, uncomfortable bed, and poor food quality.\n\n9. Sentiment Analysis:\nThe sentiment analysis suggests that the guest was mostly negative about their experience, with a score of -4 out of 10 (where 0 is neutral and 10 is extremely positive). The guest mentions several complaints, but also uses phrases like \"Staff was lovely\" to indicate some positive interactions.\n\nNote: The scores are subjective and based on my interpretation of the review.",
                "Based on the guest review, I would rate the following areas:\n\n1. Ship Overall: 6/10\nThe guest mentions that \"Places were ok\", which suggests a neutral experience with no outstanding positives or negatives.\n\n2. Ship Rooms: 4/10\nThe guest expresses frustration with excessive noise in their room due to creaking and banging walls, which is a significant issue for a comfortable stay.\n\n3. F&B Quality Overall: N/A (not mentioned)\nThere is no mention of the food quality in this review.\n\n4. F&B Service Overall: N/A (not mentioned)\nThere is no mention of the service quality in this review.\n\n5. F&B Quality Main Dining: N/A (not mentioned)\nThere is no mention of the main dining experience in this review.\n\n6. Entertainment: N/A (not mentioned)\nThere is no mention of entertainment options or experiences in this review.\n\n7. Excursions: N/A (not mentioned)\nThere is no mention of excursions or activities offered by the ship in this review.\n\n8. Primary Issues Mentioned: 9/10\nThe guest mentions a significant issue with excessive noise in their room, which is a major concern for a comfortable stay.\n\n9. Sentiment Analysis:\nThe sentiment of this review is generally negative, with the guest expressing frustration and disappointment with their experience. However, they also mention that \"Places were ok\", which suggests some positive aspects to their stay. Overall, I would rate the sentiment analysis as 5/10 (neutral to slightly negative).",
                "Based on the guest review, I would score the areas as follows:\n\n1. Ship Overall: 4/10\nThe guest mentions that the ship is \"looking old and dated\", which suggests a negative impression of the ship's overall condition.\n\n2. Ship Rooms: 3/10\nThe guest criticizes the lack of sockets in cabins and the absence of USB ports, indicating a subpar room experience.\n\n3. F&B Quality Overall: 6/10\nAlthough the guest mentions that the food in the market place is \"very limited\", especially for vegetarians, they do not provide a comprehensive assessment of the overall quality of the food.\n\n4. F&B Service Overall: 5/10\nThe guest expresses disappointment with the bar service on Deck, suggesting that it could be improved.\n\n5. F&B Quality Main Dining: N/A (not mentioned)\nThe guest does not mention anything about the quality of main dining.\n\n6. Entertainment: N/A (not mentioned)\nThe guest does not mention anything about the entertainment options on board.\n\n7. Excursions: N/A (not mentioned)\nThe guest does not mention anything about excursions.\n\n8. Primary Issues Mentioned: 2/10\nThe primary issues mentioned by the guest are:\n- Limited food options in the market place, especially for vegetarians\n- Poor breakfast experience compared to other cruise ships\n- Old and dated ship condition\n- Insufficient sockets and USB ports in cabins\n\n9. Sentiment Analysis: 4/10\nThe sentiment of the review is mostly negative, with the guest expressing disappointment and frustration with various aspects of their experience on board. However, they do not use extremely strong language or express outrage, which suggests a moderate level of dissatisfaction."
            ],
            "filteredCount": 9,
            "comparisonToOverall": -0.2
        },
        {
            "ship": "DISCOVERY 2",
            "sailingNumber": "1",
            "averageRating": 6.92,
            "ratingCount": 51,
            "filteredReviews": [
                "Based on the guest review, here are my scores:\n\n1. Ship Overall: 4/10\nThe guest mentions several negative experiences with the ship, including issues with water quality, a non-accessible balcony, and poor service.\n\n2. Ship Rooms: 3/10\nThe guest specifically mentions that the room was not suitable for their son with autism, which is a significant concern. They also mention that they were told it was a quiet room but it wasn't.\n\n3. F&B Quality Overall: N/A (not mentioned)\nThere is no mention of food quality in this review.\n\n4. F&B Staff Service Overall: 2/10\nThe guest mentions that the staff did not provide adequate service, specifically with regards to their son's needs and the room's accessibility.\n\n5. F&B Quality Main Dining: N/A (not mentioned)\nThere is no mention of food quality in this review.\n\n6. Entertainment: N/A (not mentioned)\nThere is no mention of entertainment in this review.\n\n7. Excursions: N/A (not mentioned)\nThere is no mention of excursions in this review.\n\n8. Primary Issues Mentioned: 9/10\nThe guest mentions several primary issues, including:\n- Water quality not meeting expectations\n- Non-accessible balcony\n- Poor service with regards to their son's needs\n- Room not suitable for autism\n\nHowever, I would rate the sentiment of these issues as more negative than positive, so I'm giving a lower score overall.\n\n9. Sentiment Analysis: 1/10\nThe guest's tone is overwhelmingly negative, expressing frustration and disappointment with their experience on the ship. They explicitly state that they would not recommend the room or the money they paid for it, which further reinforces this sentiment.",
                "Based on the guest review, I would rate the following areas:\n\n1. Ship Overall: 6/10\nThe guest mentions that the overall cruise was \"fine\", which suggests a neutral experience. However, they also mention several negative aspects (engine noise, vibrations, noisy room), which brings down the score.\n\n2. Ship Rooms: 4/10\nThe guest expresses disappointment with their room's noise level and lack of consideration for reassigning them to a quieter room. This is a significant issue that affects their overall experience.\n\n3. F&B Quality Overall: 8/10\nThe guest mentions that the food was \"plentiful\", which suggests a positive aspect of their dining experience. However, they do not mention anything negative about the quality of the food.\n\n4. F&B Staff Service Overall: 9/10\nThe guest praises the staff as \"brilliant\", indicating excellent service.\n\n5. F&B Quality Main Dining: N/A (not mentioned)\nSince the guest does not specifically comment on the main dining experience, I would rate this area as 'n/a'.\n\n6. Entertainment: N/A (not mentioned)\nSimilarly, the guest does not mention anything about the entertainment options or quality.\n\n7. Excursions: N/A (not mentioned)\nThe guest also does not mention any excursions or their experiences with them.\n\n8. Primary Issues Mentioned: 2/10\nThe primary issues mentioned by the guest are:\n- Engine noise and vibrations\n- Noisy room\n\nThese issues seem to be significant enough to impact their overall experience, but they do not dominate the review.\n\n9. Sentiment Analysis: 5/10\nThe sentiment of the review is mixed, with both positive (staff, food) and negative comments (room noise, lack of consideration). The guest's tone is generally disappointed and frustrated, which brings down the sentiment score.",
                "Based on the guest review, here are my scores:\n\n1. Ship Overall: 4/10\nThe guest mentions several negative experiences with their cabin and the ship's overall performance.\n\n2. Ship Rooms: 3/10\nThe guest had issues with noise from above and was unable to get a suitable replacement cabin, which affected their sleep.\n\n3. F&B Quality Overall: 5/10\nThe guest mentions that the food was \"average\" some days, good and others not so good, indicating a lack of consistency in quality.\n\n4. F&B Staff Service Overall: 6/10\nWhile the guest doesn't provide specific examples, they do mention having to ask for items at breakfast, which suggests some issues with service.\n\n5. F&B Quality Main Dining: 5/10 (same as overall F&B quality)\nThe guest's comments about food quality are consistent across both main dining and overall F&B quality.\n\n6. Entertainment: 4/10\nThe guest describes the entertainment as \"just ok\", which suggests it didn't meet their expectations.\n\n7. Excursions: N/A\nThere is no mention of excursions in the review, so I've rated this as 'n/a'.\n\n8. Primary Issues Mentioned:\n- Cabin noise and issues with replacement cabin\n- Poor sleep quality due to cabin location\n- Cancelled port of call\n- Limited transfers available in ports\n\n9. Sentiment Analysis: 2/10 (very negative)\nThe guest's tone is overwhelmingly negative, expressing disappointment and frustration with their experience on the ship.",
                "Based on the guest review, I've assigned scores between 0 and 10 for each area:\n\n1. Ship Overall: 6/10\nThe guest mentions that their cabin needs improving, which suggests some issues with the overall condition of the ship. However, they also mention that it's \"dated compared to the rest of the ship\", implying that there are still some positive aspects.\n\n2. Ship Rooms: 4/10\nThe guest specifically mentions that their cabin needs improvement and that the drawers wouldn't open, which suggests a significant issue with the room.\n\n3. F&B Quality Overall: 5/10\nThe guest mentions that the food in main dining was inconsistent and sometimes not sufficient, which is a concern. However, they don't mention any major issues with the quality of other food options.\n\n4. F&B Staff Service Overall: N/A (not mentioned)\nThere's no mention of the staff service in the review.\n\n5. F&B Quality Main Dining: 3/10\nThe guest specifically mentions that the food in main dining was inconsistent and sometimes not sufficient, which suggests a significant issue with this area.\n\n6. Entertainment: N/A (not mentioned)\nThere's no mention of the entertainment options in the review.\n\n7. Excursions: N/A (not mentioned)\nThere's no mention of excursions in the review.\n\n8. Primary Issues Mentioned: 2/10\nThe guest mentions two primary issues:\n- Cabin needs improving\n- Food in main dining was inconsistent and sometimes not sufficient\n\n9. Sentiment Analysis: 4/10\nThe sentiment of the review is neutral to slightly negative, with a focus on the guest's disappointment with their cabin and food experiences. However, they don't seem to be extremely dissatisfied or angry, which suggests a moderate level of dissatisfaction.",
                "Based on the guest review, I would rate the following attributes:\n\n1. Ship Overall: 6/10\nThe guest mentions that the ship was \"good\" overall, but also states that it was \"let down by the restaurant experience\". This suggests that while the ship had some positive aspects, it was not entirely to their satisfaction.\n\n2. Ship Rooms: 4/10\nThe guest mentions that the cabin size was good, but also notes that the cabin was \"tired and worn\" with issues such as a mouldy shower curtain and black silicone in the shower room. This suggests that the rooms were not up to par.\n\n3. F&B Quality Overall: 5/10\nThe guest mentions that some of the food options, such as Turf and Surf restaurant and Gallery 47, were good. However, they also mention issues with the buffet restaurant being very busy, slow service in restaurant 47, poor menu choice, and sometimes poor cocktails.\n\n4. F&B Staff Service Overall: 7/10\nThe guest mentions that all staff worked hard and were efficient and pleasant, which suggests a high level of service overall.\n\n5. F&B Quality Main Dining: 3/10\nThe guest's experience with main dining was largely negative, citing slow service and poor menu choice.\n\n6. Entertainment: 8/10\nThe guest mentions that the daily programmes were good and plenty to do, and that the entertainment staff worked hard.\n\n7. Excursions: N/A\nThis attribute is not mentioned in the review.\n\n8. Primary Issues Mentioned: 2/10 (Strong odour around water cooler on deck 7, poor service in restaurant 47)\nThe guest mentions two primary issues: a strong unpleasant smell around the water cooler and slow/poor service in restaurant 47.\n\n9. Sentiment Analysis: 4/10\nThe sentiment of the review is generally negative, with the guest expressing disappointment with their experience, particularly with the restaurant. However, they also mention some positive aspects, such as the efficiency of the staff and the quality of certain food options.",
                "Here are my scores based on the guest review:\n\n1. Ship Overall: 6/10\nThe guest mentions that they had a \"very good cruise\", indicating a positive experience overall. However, the negative comments about the weather and noise issue in certain cabins bring down the score.\n\n2. Ship Rooms: 4/10\nThe guest specifically mentions a noise problem in the cabins under the Glass House on deck 8, which is a significant concern. The lack of transparency about this issue also detracts from their overall satisfaction with the ship's rooms.\n\n3. F&B Quality Overall: N/A (not mentioned)\nThere is no mention of the food and beverage quality in the guest review.\n\n4. F&B Staff Service Overall: N/A (not mentioned)\nSimilarly, there is no mention of the staff service in the guest review.\n\n5. F&B Quality Main Dining: N/A (not mentioned)\nAs with the previous two points, there is no mention of the main dining experience or quality.\n\n6. Entertainment: N/A (not mentioned)\nThe guest does not mention anything about the entertainment on board.\n\n7. Excursions: N/A (not mentioned)\nThere is no mention of excursions in the guest review.\n\n8. Primary Issues Mentioned: 9/10\nThe primary issues mentioned by the guest are the noise problem in certain cabins and the lack of transparency about this issue. The only reason they did not give a perfect score is that they felt it was an oversight on the part of the cruise line.\n\n9. Sentiment Analysis: 4/10\nWhile the guest mentions that they had a \"very good cruise\", the negative comments about the weather and noise issue bring down their overall sentiment. The tone is mostly disappointed and frustrated, rather than enthusiastic or excited.",
                "Based on the guest review, here are the scores:\n\n1. Ship Overall: 6/10\nThe guest mentions several negative aspects of their experience, including the lack of bottled water and issues with the room's condition. However, they also mention some positive aspects, such as the staff, food, and premium drinks.\n\n2. Ship Rooms: 4/10\nThe guest expresses disappointment with the size and condition of their room, describing it as \"very small and compact\" and stating that the furniture is \"well worn\". They also mention specific issues with the bathroom, including mould and a shower curtain that's loose on its hooks.\n\n3. F&B Quality Overall: 8/10\nThe guest mentions that the staff, food, and premium drinks were all \"fantastic\", indicating a high level of quality in these areas.\n\n4. F&B Staff Service Overall: 9/10\nThe guest specifically praises the staff, stating that they were excellent.\n\n5. F&B Quality Main Dining: N/A (not mentioned)\nThis attribute is not mentioned in the review.\n\n6. Entertainment: N/A (not mentioned)\nThis attribute is not mentioned in the review.\n\n7. Excursions: N/A (not mentioned)\nThis attribute is not mentioned in the review.\n\n8. Primary Issues Mentioned: 2/10\nThe guest mentions two primary issues: the lack of bottled water and the poor condition of their room. However, they also mention several other issues, such as the shower curtain being loose and the bathroom needing a big revamp.\n\n9. Sentiment Analysis: 5/10\nThe guest's sentiment is generally negative, with several complaints about the ship's amenities and services. However, they do express some positive sentiments about the staff, food, and premium drinks. Overall, their tone is disappointed and frustrated, but not overwhelmingly angry or hostile.",
                "Based on the provided guest review, I would rate the areas as follows:\n\n1. Ship Overall: 6/10\nThe guest mentions a significant issue with their cabin (noise), which detracts from their overall experience. However, they also mention that the cruise was \"very good\", suggesting that there were positive aspects to their trip.\n\n2. Ship Rooms: 4/10\nThe guest's cabin was noisy, which is a major concern for any traveler. This suggests that the ship's rooms may not be well-insulated or maintained.\n\n3. F&B Quality Overall: N/A\nThere is no mention of the food quality in this review.\n\n4. F&B Staff Service Overall: N/A\nSimilarly, there is no mention of the staff service in this review.\n\n5. F&B Quality Main Dining: N/A\nAs mentioned earlier, there is no mention of the food quality in this review.\n\n6. Entertainment: N/A\nThere is no mention of the entertainment options on board in this review.\n\n7. Excursions: N/A\nThere is no mention of excursions or activities offered by the cruise line in this review.\n\n8. Primary Issues Mentioned: 9/10 (Noise issue)\nThe guest mentions a significant noise issue with their cabin, which was a major concern for them.\n\n9. Sentiment Analysis:\nThe sentiment of this review is mixed, but overall it seems that the guest was somewhat disappointed with their experience due to the noise issue. However, they also mention that the cruise was \"very good\", suggesting that there were positive aspects to their trip. I would rate the sentiment analysis as 5/10, indicating a generally neutral tone with some negative undertones.",
                "Based on the guest review, I would rate the following attributes:\n\n1. Ship Overall: 7/10\nThe guest mentions that it was a \"good cruise\" and \"good value all round\", indicating a positive overall experience. However, they also mention some negative aspects (e.g., inside cabin size and dated decor).\n\n2. Ship Rooms: 4/10\nThe guest specifically mentions that their inside cabin was \"too small\" and \"dated\". This suggests a significant issue with the room's quality.\n\n3. F&B Quality Overall: 8/10\nAlthough the guest doesn't provide detailed feedback on food quality, they mention that staff were excellent, which implies that service was good. However, they do express disappointment with some aspects of their dining experience (see below).\n\n4. F&B Staff Service Overall: 9/10\nThe guest explicitly states that \"staff were excellent\", indicating high levels of service.\n\n5. F&B Quality Main Dining: N/A\nThis attribute is not mentioned in the review.\n\n6. Entertainment: 6/10\nThe guest mentions some positive aspects (e.g., good value) but also expresses disappointment with the entertainment, specifically stating that some staff seemed to think they were at a kids' party. They also mention a desire for more daytime dancing and music from specific decades.\n\n7. Excursions: N/A\nThis attribute is not mentioned in the review.\n\n8. Primary Issues Mentioned: 5/10 (Ship Rooms)\nThe guest's primary issue was with their inside cabin, which they found too small and dated.\n\n9. Sentiment Analysis:\nThe sentiment of the review is generally positive, with phrases like \"good cruise\", \"staff excellent\", and \"good value all round\". However, there are also some negative comments about the ship rooms and entertainment, which slightly balance out the positivity. Overall, I would rate the sentiment analysis as 7/10 (positive).",
                "Based on the guest review, I would score the following areas:\n\n1. Ship Overall: 6/10\nThe guest mentions that the ship is \"fine\", which suggests it meets their basic expectations but doesn't exceed them.\n\n2. Ship Rooms: 4/10\nThe guest expresses disappointment with their cabin, specifically mentioning its small size and poor bathroom facilities compared to balcony cabins. This suggests a room that falls short of their expectations.\n\n3. F&B Quality Overall: 7/10\nAlthough the guest mentions some issues with the self-service buffet (difficulty finding a seat), they also mention \"good value for money\" and \"excellent staff\", which suggests overall satisfaction with the food and beverage experience.\n\n4. F&B Staff Service Overall: 8/10\nThe guest praises the staff as \"excellent\", indicating high levels of service quality.\n\n5. F&B Quality Main Dining: N/A (not mentioned)\nThis attribute is not mentioned in the review, so I would rate it as 'n/a'.\n\n6. Entertainment: 7/10\nThe guest mentions that the entertainment was good, but doesn't provide any specific details or criticisms.\n\n7. Excursions: N/A (not mentioned)\nThis attribute is also not mentioned in the review, so I would rate it as 'n/a'.\n\n8. Primary Issues Mentioned: 2/10\nThe primary issues mentioned by the guest are:\n- Small and poorly designed cabin\n- Poor bathroom facilities compared to balcony cabins\n- Difficulty finding a seat at the self-service buffet\n\nThese issues suggest that there were some significant problems with their room and dining experience.\n\n9. Sentiment Analysis: 5/10\nThe sentiment of the review is generally positive, but also includes several criticisms and disappointments. The guest seems to be satisfied with the ship overall, staff, and entertainment, but has some notable issues with their cabin and dining experience."
            ],
            "filteredCount": 10,
            "comparisonToOverall": -0.16
        },
        {
            "ship": "DISCOVERY",
            "sailingNumber": "1",
            "averageRating": 7.41,
            "ratingCount": 58,
            "filteredReviews": [
                "Based on the guest review, I would rate the following areas as follows:\n\n1. Ship Overall: 6/10\nThe guest had a brilliant time overall, but mentioned some negative aspects such as the standard of service in the restaurants and the dated cabins.\n\n2. Ship Rooms: 4/10\nThe guest described the cabins as \"dated and scruffy\", indicating that they were not impressed with the accommodation quality.\n\n3. F&B Quality Overall: 7/10\nThe guest mentioned that the standard of service in the restaurants had gone down due to a lack of staff, but also praised the staff for their hard work and friendliness.\n\n4. F&B Staff Service Overall: 8/10\nThe guest praised the staff for their excellent service, particularly mentioning Elaine and Heather, who organized their wedding renewal ceremony.\n\n5. F&B Quality Main Dining: 6/10\nThe guest mentioned that the standard of service had gone down in the restaurants, but did not provide further details.\n\n6. Entertainment: N/A\nThere is no mention of entertainment in the review.\n\n7. Excursions: 2/10\nThe guest specifically mentioned that going to the American Virgin Islands was \"not worth all the trouble it involved\", indicating a poor experience with excursions.\n\n8. Primary Issues Mentioned: \n- Lack of staff in restaurants\n- Dated and scruffy cabins\n- Poor value for money on premium drinks package\n\n9. Sentiment Analysis:\nThe overall sentiment of the review is mixed, with some positive comments about the staff and entertainment (although there was no mention of entertainment), but also several negative comments about the standard of service, accommodation quality, and excursions.",
                "Based on the guest review, I would rate the following attributes:\n\n1. Ship Overall: 7/10\nThe guest mentions that they had a good cruise overall, but also mentions some negative aspects such as the cramped cabin and poor meal experience.\n\n2. Ship Rooms: 4/10\nThe guest specifically mentions that their cabin (6130) was too cramped for three people and would not recommend it again.\n\n3. F&B Quality Overall: 5/10\nThe guest had a poor experience with the main dining room on the last night of the cruise, waiting over half an hour for food and receiving subpar dishes.\n\n4. F&B Staff Service Overall: 9/10\nThe guest praises all staff members as \"very nice and polite\" and mentions that they interacted well with passengers.\n\n5. F&B Quality Main Dining: 3/10\nAs mentioned earlier, the guest had a poor experience with the main dining room on the last night of the cruise.\n\n6. Entertainment: N/A\nThe guest does not mention anything about the entertainment options on board.\n\n7. Excursions: N/A\nThe guest does not mention anything about excursions or their experiences with them.\n\n8. Primary Issues Mentioned: 2/10 (Cabin size and poor main dining experience)\nThe guest mentions two primary issues that they had during the cruise: the cramped cabin and the poor meal experience in the main dining room.\n\n9. Sentiment Analysis: 6/10\nOverall, the guest's sentiment is mixed, with some positive comments about the staff and food in certain areas (Island buffet), but also several negative comments about the cabin and main dining experience.",
                "Based on the guest review, I would rate the following areas as follows:\n\n1. Ship Overall: 6/10\nThe guest mentions that the ship is \"getting a little tired\", which suggests that it may be showing signs of aging and potentially in need of refurbishment.\n\n2. Ship Rooms: 4/10\nThe guest's cabin (7119) was described as \"very tight\" with issues such as a bed obstructing the gap to get past, a similar gap on the other side, and a shower room that needed refurbishment.\n\n3. F&B Quality Overall: 5/10\nThe guest mentions that the food in the restaurants was inconsistent and that the upgraded drink package was not stocked consistently across all bars, which suggests that the quality of the food and beverage offerings may be lacking.\n\n4. F&B Staff Service Overall: N/A (not mentioned)\nThere is no mention of the staff service in the review, so I would rate this area as 'n/a'.\n\n5. F&B Quality Main Dining: 4/10\nSimilar to the overall F&B quality rating, the guest mentions that the food was inconsistent.\n\n6. Entertainment: N/A (not mentioned)\nThe guest does not mention anything about the entertainment options on board, so I would rate this area as 'n/a'.\n\n7. Excursions: N/A (not mentioned)\nThere is no mention of excursions in the review, so I would rate this area as 'n/a'.\n\n8. Primary Issues Mentioned: 2/10\nThe guest mentions two primary issues: the cabin's layout and the shower room's condition.\n\n9. Sentiment Analysis:\nThe sentiment analysis suggests that the guest was generally dissatisfied with their experience on board. The use of words such as \"disappointing\" and \"unlikely to book again\" indicates a negative tone. However, it's worth noting that the guest does mention one positive aspect (the cleaning staff being efficient), which suggests that there may be some redeeming qualities to the ship or its service. Overall, I would rate the sentiment analysis as 4/10.",
                "Based on the guest review, here are my scores:\n\n1. Ship Overall: 6/10\nThe guest mentions that they \"enjoyed most of the cruise\", which suggests a positive experience overall. However, they also mention several negative aspects, such as the long stay cabin fiasco and poor entertainment.\n\n2. Ship Rooms: 4/10\nThe guest specifically mentions a problem with their cabin, stating that they were told they couldn't cancel when asked to leave at 12:30. This suggests a significant issue with the room or the way it was managed.\n\n3. F&B Quality Overall: N/A\nThere is no mention of food quality in the review.\n\n4. F&B Staff Service Overall: N/A\nThere is no mention of food and beverage staff service in the review.\n\n5. F&B Quality Main Dining: N/A\nThere is no mention of main dining experience in the review.\n\n6. Entertainment: 2/10\nThe guest mentions that the entertainment on Discovery was \"poor\", which suggests a significant disappointment with this aspect of their cruise.\n\n7. Excursions: N/A\nThere is no mention of excursions in the review.\n\n8. Primary Issues Mentioned: 9/10 (Ship Rooms, Poor Entertainment, Poor Customer Service)\nThe guest mentions several specific issues that they were unhappy about, including the long stay cabin fiasco and poor entertainment. They also express frustration with the way TUI handled their situation.\n\n9. Sentiment Analysis: -8/10\nThe overall sentiment of the review is extremely negative, with the guest expressing disappointment, frustration, and even anger towards TUI's handling of their situation. The only positive comment is a brief mention that they \"enjoyed most of the cruise\", but this is vastly outweighed by the negative comments.",
                "Based on the provided guest review, I would rate the cruise as follows:\n\n1. Ship Overall: 6/10\nThe guest mentions that their cabin was \"very tired and needed refurbishment\", which suggests a negative experience with the ship's interior condition.\n\n2. Ship Rooms: 4/10\nThe guest's comment about the cabin being tired and in need of refurbishment indicates a subpar room experience.\n\n3. F&B Quality Overall: 5/10\nThe guest mentions that food quality in the main restaurant was \"very unpredictable\", which is a negative aspect. However, they also mention that Kora La food was excellent, suggesting some positive experiences with food quality.\n\n4. F&B Staff Service Overall: 8/10\nThe guest praises Algie at reception as \"exceptional\", indicating a high level of service from the staff.\n\n5. F&B Quality Main Dining: 3/10\nThe guest mentions that food quality in the main restaurant was \"very unpredictable\", which is a significant negative aspect.\n\n6. Entertainment: N/A\nThere is no mention of entertainment in the review, so I would rate it as 'n/a'.\n\n7. Excursions: N/A\nThere is no mention of excursions in the review, so I would rate it as 'n/a'.\n\n8. Primary Issues Mentioned: 1/10 (Ship Rooms)\nThe guest's primary issue mentioned is the condition of their cabin.\n\n9. Sentiment Analysis:\nThe sentiment analysis suggests that the guest had a mixed experience on the cruise. While they enjoyed some aspects, such as the shows and Algie's exceptional service, they were also disappointed with the food quality in the main restaurant and the state of their cabin. The overall sentiment is slightly negative, but not overwhelmingly so.\n\nNote: Sentiment Analysis scores are subjective and may vary depending on the specific analysis tool or methodology used.",
                "Based on the guest review, I would rate the following attributes:\n\n1. Ship Overall: 8/10\nThe guest mentions that the ship was great overall, but also highlights some areas for improvement (value for basic cabins).\n\n2. Ship Rooms: 4/10\nThe guest criticizes the size of the basic cabins, stating they are \"tiny with very little room\".\n\n3. F&B Quality Overall: 9/10\nThe guest praises the food and drinks, calling them \"nice\" and \"exceptional\".\n\n4. F&B Staff Service Overall: 10/10\nThe guest raves about the staff, saying they are \"friendly and amazing\", and that nothing is too much for them.\n\n5. F&B Quality Main Dining: 9/10 (implied by the praise of the food)\nWhile not explicitly stated, the guest's positive comments about the food suggest high quality in main dining.\n\n6. Entertainment: 8/10\nThe guest mentions that there's a \"great range of entertainment\" onboard, but doesn't provide specific details or criticisms.\n\n7. Excursions: N/A\nExcursions are not mentioned by the guest at all.\n\n8. Primary Issues Mentioned: Value for basic cabins ( tiny rooms for high price)\nThe guest highlights this as an area for improvement.\n\n9. Sentiment Analysis:\nThe sentiment of the review is overwhelmingly positive, with the guest using words like \"great\", \"amazing\", and \"friendly\" to describe their experience. The only criticism mentioned is related to value, but it's not a major negative comment. Overall, the tone is enthusiastic and recommends the cruise.",
                "Based on the guest review, I would score it as follows:\n\n* Ship Overall: 6/10\nThe guest enjoyed their cruise overall but had several issues that negatively impacted their experience.\n\n* Ship Rooms: 4/10\nThe guest mentioned that their cabin was extremely noisy and they were unable to sleep well due to the noise. They also requested a quiet room, which suggests that the ship's accommodation options may not be meeting expectations.\n\n* F&B Quality Overall: 7/10\nThe guest mentioned that food and entertainment were good, but this is a relatively neutral comment and does not provide much insight into their overall satisfaction with the F&B quality.\n\n* F&B Staff Service Overall: 6/10\nThe guest's comments about being abandoned at the hotel without being able to stay on the ship for lunch suggest that there may be issues with communication or coordination between the ship's staff and the hotel staff. However, this is a relatively minor issue compared to their cabin noise complaints.\n\n* F&B Quality Main Dining: 7/10 (n/a)\nThe guest did not provide any specific comments about the quality of main dining, so I would rate it as 'n/a'.\n\n* Entertainment: 6/10\nThe guest mentioned that food and entertainment were good, but this is a relatively neutral comment and does not provide much insight into their overall satisfaction with the entertainment options.\n\n* Excursions: n/a\nThe guest did not mention excursions at all, so I would rate it as 'n/a'.\n\n* Primary Issues Mentioned: 8/10\nThe guest mentioned several primary issues, including extremely noisy cabin, being abandoned at the hotel without being able to stay on the ship for lunch, and the main cabin lights being left on during the overnight flight. These issues seem to be significant enough to impact their overall satisfaction with the cruise.\n\n* Sentiment Analysis: 4/10\nThe guest's sentiment is generally negative, with several complaints about their experience on the ship. However, they did mention that they \"enjoyed the cruise\" at the beginning of the review, which suggests that there were some positive aspects to their experience. Overall, the negative comments seem to outweigh the positive ones, resulting in a lower sentiment analysis score.",
                "Here are the scores based on the guest review:\n\n1. Ship Overall: 4/10\nThe guest had a disappointing experience with bed bugs in their cabin, which is a major concern for any traveler. The ship's overall quality and cleanliness seem to be compromised due to this issue.\n\n2. Ship Rooms: 3/10\nThe guest was unhappy with the condition of their original cabin (2536) and the subsequent rooms they were offered as alternatives. The lack of communication and follow-up from the staff made the situation even more frustrating.\n\n3. F&B Quality Overall: N/A\nThere is no mention of the food quality in this review, so I couldn't score it.\n\n4. F&B Staff Service Overall: N/A\nSimilarly, there is no mention of the food and beverage staff service in this review.\n\n5. F&B Quality Main Dining: N/A\n\n6. Entertainment: N/A\nThere is no mention of the entertainment options on board in this review.\n\n7. Excursions: N/A\nThere is no mention of excursions or activities offered by the ship in this review.\n\n8. Primary Issues Mentioned: Bed bugs, poor communication from staff, lack of follow-up apology procedure, and concerns about transporting bed bugs home.\n\n9. Sentiment Analysis:\nThe sentiment of this review is overwhelmingly negative. The guest was stressed, frustrated, and disappointed with their experience on board due to the bed bug issue and poor communication from the staff. They also express anxiety about potentially transporting bed bugs home and having further stresses to deal with as a follow-up."
            ],
            "filteredCount": 8,
            "comparisonToOverall": 0.33
        }
    ]
}